<template>
    <div class="titlebox">
    <el-image src="/images/miscellaneous/blacksmith.gif" style="width: 100px;height: 100px;"/>
    <span class="title">铁匠任务</span>
  </div>
    
<p>点击铁匠对话得到镐子后可以进入挖矿层，铁匠房间会有一个楼梯作为入口。挖矿层会生成1个巨型房间，3个大型房间:6~8个小型房间，和1~2个包含3~5金矿的不相连的秘密洞穴，总共生成42~46个金矿</p>
<p>具有三倍的刷怪间隙(150回合)，比外边楼层少1刷怪上限。在这里锁链可以穿墙，传送到寻路上不可抵达的格子。</p>
<p>每局游戏只能进入一次，上楼梯时视为任务结束。结束任务时，挖矿获取人情为金矿数量x50，上限2000，如果击败boss额外增加1000人情，以获取人情数作为排行榜统计时的铁匠任务分数(花费没有影响)。铁匠会收回镐子，但是保留它所有数据(即便是诅咒)</p>
<p>花费250人情可以获得之前那把镐子，如果任务分数超过2500，则改为不消耗人情免费送。花费500人情可以旧版本重铸，融合两个一样已鉴定物品为第一件物品等级+1。每次使用所需人情加1000。花费500人情可以硬化武器或护甲，升级装备后检测附魔或刻印是否该被消除时，硬化过的装备用于计算的等级-2。若依日被消除时，将失去硬化效果来抵挡一次消除。每次使用所需人情加1000。花费1000人情升级一件可升级的已鉴定的小于3级的物品。每次使用所需人情加1000</p>
<p>花费2000人情可以从两件不同类的武器和件护甲中选择一件带走，他们未被鉴定，也没有任何附魔刻印与诅咒，等级为15%概率+0,55%概率+1,20%概率:+2,5%概率+3。花费全部人情一比一换成金币</p>
</template>

<script>
export default {
    name: 'BlackSmith',
    data() {
        return {

        }
    }
}

</script>

<style scoped lang="less">
  .titlebox{
  display: flex;
  align-items: center;
  .title{
    font-size: 40px;
    color: rgb(255,255,68);
    text-shadow:
        -2px -2px 0 #000, /* 左上 */
        2px -2px 0 #000, /* 右上 */
        -2px 2px 0 #000, /* 左下 */
        2px 2px 0 #000; /* 右下 */
  }
}
:deep(.gg){
  color: rgb(255,255,68);
  text-shadow:
      -2px -2px 0 #000, /* 左上 */
      2px -2px 0 #000, /* 右上 */
      -2px 2px 0 #000, /* 左下 */
      2px 2px 0 #000; /* 右下 */
}
p{
  color: white;
  text-shadow:
      -1px -1px 0 #000, /* 左上 */
      1px -1px 0 #000, /* 右上 */
      -1px 1px 0 #000, /* 左下 */
      1px 1px 0 #000; /* 右下 */
}
  </style>