<template>
    <div class="titlebox">
    <el-image src="/images/miscellaneous/large_buffs/part-Slice15.png" style="width: 100px;height: 100px;"/>
    <span class="title">负面效果</span>
  </div>
    
<p>狂乱:使怪物随机攻击最近的生物，优先攻击敌方目标。</p>
<p>流血:每回合造成当前流血数值的伤害，下一回合数值变为原值的50%~100%。</p>
<p>失明:视野范围减小到1。</p>
<p>燃烧:每回合造成1~3+层数/4点伤害，每4~6回合烧毁一件可燃物，水(包括药水)霜冻立即解除。</p>
<p>魅惑:无法使用近战武器攻击施加者，受到伤害会减少5回合持续时间。</p>
<p>霜冻:每1回合霜冻造成10%线性减速，至多降至50%，解除燃烧。</p>
<p>酸蚀:伤害低于层数/2+2时，每回合增加1点伤害，否则增加0.5点。</p>
<p>腐化:将生物强制转化为盟友关系，每回合受到1%的累计伤害。</p>
<p>残废:移速减半。</p>
<p>降级:将武器防具法杖等级削弱为sqrt(2*(原始等级-1))+1。等级对应关系(降级后/降级前):1/1,2/2,3/(3,4),4/(5,7)5/(8,11),6/(12,16),7/(17.22)。阅读升级卷轴或驱邪卷轴可立刻解除。</p>
<p>定命:受到的所有伤害+67%。</p>
<p>冰冻:冻结角色行动，并冻结一件物品，解除燃烧。</p>
<p>幻惑:降低20%命中与闪避。</p>
<p>极度饥饿:每回合损失千分之一生命值。</p>
<p>腐蚀污泥:每回合造成层数/5点伤害，0~4层为0.5点，水(包括药水)立即解除。</p>
<p>麻痹:取消一切行动，每次受到伤害时判断是否解除，判定法则:0~受到总伤害(每回合衰减10%)，与，0~日前生命值，各随机取一个数，前者不小于后者则解除。</p>
<p>中毒:每回合造成1+剩余时长/3点伤害。</p>
<p>生根:无法移动，漂浮效果可立即解除。</p>
<p>迟缓:所有行动速度减半。</p>
<p>恐惧:使得生物尽可能远离敌人，受到伤害会减少5回合持续时间。</p>
<p>眩晕:移动时随机向周围的8格移动。</p>
<p>易伤:增加33%受到的伤害。</p>
<p>虚弱:减少33%物理攻击伤害。</p>
<p>灵魂标记(术士):使用法杖攻击时有1.07-0.92^(法杖等级*每次使用充能+1)的率标记目标10+法杖等级回合，目标受到来自玩家的物理伤害时，玩家回复等同于伤害*0.4的生命值。</p>
<p>魂飞魄散:以双倍速度逃离施加者，离开视野后将其移除出游戏。受到伤害时效果时长减少5回合。</p>
</template>

<script>
export default {
    name: 'BuffNeg1',
    data() {
        return {

        }
    }
}

</script>

<style scoped lang="less">
  .titlebox{
  display: flex;
  align-items: center;
  .title{
    font-size: 40px;
    color: rgb(255,255,68);
    text-shadow:
        -2px -2px 0 #000, /* 左上 */
        2px -2px 0 #000, /* 右上 */
        -2px 2px 0 #000, /* 左下 */
        2px 2px 0 #000; /* 右下 */
  }
}
:deep(.gg){
  color: rgb(255,255,68);
  text-shadow:
      -2px -2px 0 #000, /* 左上 */
      2px -2px 0 #000, /* 右上 */
      -2px 2px 0 #000, /* 左下 */
      2px 2px 0 #000; /* 右下 */
}
p{
  color: white;
  text-shadow:
      -1px -1px 0 #000, /* 左上 */
      1px -1px 0 #000, /* 右上 */
      -1px 1px 0 #000, /* 左下 */
      1px 1px 0 #000; /* 右下 */
}
  </style>