<template>
    <div class="titlebox">
    <el-image src="/images/miscellaneous/large_buffs/part-Slice20.png" style="width: 100px;height: 100px;"/>
    <span class="title">正面效果</span>
  </div>
    
<p>激素涌动(力量的合剂):力量+x，每若干回合衰减1点。</p>
<p>激素涌动(激素飞镖):2倍 移动速度与1.5倍攻击速度。</p>
<p>秘法护盾(抗魔秘药):提供一定值的魔法伤害防御并减半部分负面效果持续时间(同敌法)。</p>
<p>神器充能:为背包内所有神器恢复充能(无充能者会有额外效果)，处于背包中且拥有轻便斗篷天赋时的暗影斗篷也有效，具体效果见各神器。</p>
<p>树肤:提供0~最大值的物理防御，最大值每过一段时间减少1点。</p>
<p>护盾:优先吸收大部分伤害，但护盾会随时间衰减(大部分情况每回合-1或是5%，取较小者)</p>
<p>祝福:增加25%命中与闪避。</p>
<p>净化屏障:免疫所有负面环境效果(包括天狗的炸弹、蛛网)。</p>
<p>魔法睡眠:生物进入无法被脚步声唤醒的睡眠，受到伤害时打断，若是玩家或友方生物则每回合恢复1点生命值。</p>
<p>火焰之力:攻击50%点燃目标8回合，免疫燃烧。</p>
<p>晶触之力:攻击使目标叠加3回合霜冻，免疫霜冻与冻结。</p>
<p>危险预知(秘卷):立即发现视野内隐藏地形</p>
<p>极速(药剂):3倍的移动速度。</p>
<p>治疗:每回合恢复剩余总量的一定比例(通常是25%)的生命，优先级非常高。</p>
<p>隐身:绝大多数生物无法发现隐形的目标，但不代表完全不知道隐身者的方位。</p>
<p>漂浮:无视陷阱、裂缝、草等地形并降低被发现的概率，立即解除生根。</p>
<p>系命(玩家目前无法获得):两角色平分伤害直到至少一方死亡。</p>
<p>发光:将视野扩大至6格。</p>
<p>部分负面效魔法免疫:免疫所有魔法伤害、果以及一些特殊能力(如魔像)，禁止卷轴结晶法杖使用，附魔与刻印与戒指与神器暂时无效。</p>
<p>灵视:看到本层所有生物及周围一格。</p>
<p>虹卫替身:有敌人时产生虹卫镜像攻击敌人，没有时收回分身并缓慢恢复生命。</p>
<p>充能:为所有法杖恢复每回合0.25点充能。</p>
<p>暗影重合(花圃内):隐身，视野降为1，饥饿速度减少到2/3。</p>
<p>体力充沛:移速提升50%。</p>
<p>毒性之力:自身不断释放毒气，免疫毒气与中毒。</p>
<p>饱腹(全肉大饼):每18回合回复1点生命，饱腹存在时不扣除饥饿度。</p>
</template>

<script>
export default {
    name: 'BuffPos1',
    data() {
        return {

        }
    }
}

</script>

<style scoped lang="less">
  .titlebox{
  display: flex;
  align-items: center;
  .title{
    font-size: 40px;
    color: rgb(255,255,68);
    text-shadow:
        -2px -2px 0 #000, /* 左上 */
        2px -2px 0 #000, /* 右上 */
        -2px 2px 0 #000, /* 左下 */
        2px 2px 0 #000; /* 右下 */
  }
}
:deep(.gg){
  color: rgb(255,255,68);
  text-shadow:
      -2px -2px 0 #000, /* 左上 */
      2px -2px 0 #000, /* 右上 */
      -2px 2px 0 #000, /* 左下 */
      2px 2px 0 #000; /* 右下 */
}
p{
  color: white;
  text-shadow:
      -1px -1px 0 #000, /* 左上 */
      1px -1px 0 #000, /* 右上 */
      -1px 1px 0 #000, /* 左下 */
      1px 1px 0 #000; /* 右下 */
}
  </style>