<template>
    <div class="titlebox">
    <el-image src="/images/miscellaneous/terrain_features/part-Slice64.png" style="width: 100px;height: 100px;"/>
    <span class="title">陷阱</span>
  </div>
    
<p>下列与层数挂钩的伤害，拿到护符返程时均以26代替层数计算</p>
<p>警报陷阱:唤醒并吸引全敌对生物至陷阱地点。</p>
<p>爆炎陷阱:5*5的区域5回合燃烧，水面上降为1回合。</p>
<p>烈焰陷阱:3*3区域2回合燃烧。</p>
<p>寒气陷阱:3*3冰霜效果，持续10回合。</p>
<p>致眩气体陷阱:释放300+20*层数的眩晕气体。</p>
<p>酸蚀气体陷阱:释放80+5*层数的，初始强度为1+层数/4的酸蚀气体。</p>
<p>诅咒陷阱:诅咒物品或装备，优先诅咒无附魔/刻印的武器、护甲。</p>
<p>缴械陷阱:将玩家的武器传送到10~20格远处，但能看到位置。</p>
<p>解离陷阱:对最近目标造成(层数+(30~50))点伤害，不隐藏。</p>
<p>重构陷阱:随机生成怪物3~5只，生成怪物等级为30。1%生成鼠王，一定会生成宝箱怪、石像、幽灵、鱼之一，可能出现稀有怪。</p>
<p>爆炸陷阱:等同于原地爆炸的炸弹。</p>
<p>闪光陷阱:对目标造成0~4+层数的伤害(防御可减免)，并附加等同于伤害的流血、10口合失明、20回合残废。无限触发。</p>
<p>羊群陷阱:5*5区域内生成6回合魔法绵羊。</p>
<p>冰霜陷阱:5*5冰霜效果，持续20回合。</p>
<p>即死陷阱:对最近目标造成50%最大生命值+50%当前生命值的伤害(四舍五入)，若目标为英雄则有90%最大生命值的伤害上限。</p>
<p>捕猎陷阱:对目标造成0~2+层数的伤害(防御可减免)，并附加等同于伤害的流血、10回合残废。无限触发。</p>
<p>守卫陷阱:在警报陷阱基础上多生成持有+0武器的石像，数量为层数/5-1。</p>
<p>淤泥陷阱:3*3区域20回合腐蚀污泥。</p>
<p>塌方陷阱:3*3陷落，有1回合延迟。无法在boss层使用。</p>
<p>毒镖陷阱:对最近的目标发射毒镖，造成4~8点伤害并施加8+层数*0.67回合的中毒。</p>
<p>落石陷阱:对整个房间或是5*5区域内所有生物造成5+层数~10+层数*2点伤害并造成10回合麻痹。</p>
<p>电击陷阱:3*3区域10回合电击。</p>
<p>雷暴陷阱:5*5区域20回合电击。电击效果对范围内的生物造成每两回合0~2+层数/5点伤害，每回合施加1回合麻痹，范围内的法杖每回合恢复1/3点充能。</p>
<p>召唤陷阱:生成1~3只当前楼层生成的怪物</p>
<p>传送陷阱:将陷阱及其周围的目标随机传送到本层各处。</p>
<p>毒气陷阱:生成300+20*层数的毒气。</p>
<p>扭曲陷阱:将陷阱及其周围的目标随机传送，玩家受影响则会遗忘本层探索。</p>
<p>虚弱陷阱:对目标附加60回合虚弱:boss/miniboss则为10口合。</p>
<p>老化的飞镖陷阱:对最近生物发射飞镖造成4~8点伤害。</p>
<p>虫洞陷阱:将陷阱及其周围的目标传送到个固定地点，不会损坏。传送有安全检查。</p>
<p>激流陷阱:将临近的目标按照陷阱与目标连线的方向击退2格，将距离小于2的地格变为水，距离等于2的地格有2/3概率变为水。清除变为水的地格处的火焰。对落点的火属性生物造成5+层数~10+层数*2的伤害，周围八格只受到前者2/3伤害</p>
</template>

<script>
export default {
    name: 'Trap1View',
    data() {
        return {

        }
    }
}

</script>

<style scoped lang="less">
  .titlebox{
  display: flex;
  align-items: center;
  .title{
    font-size: 40px;
    color: rgb(255,255,68);
    text-shadow:
        -2px -2px 0 #000, /* 左上 */
        2px -2px 0 #000, /* 右上 */
        -2px 2px 0 #000, /* 左下 */
        2px 2px 0 #000; /* 右下 */
  }
}
:deep(.gg){
  color: rgb(255,255,68);
  text-shadow:
      -2px -2px 0 #000, /* 左上 */
      2px -2px 0 #000, /* 右上 */
      -2px 2px 0 #000, /* 左下 */
      2px 2px 0 #000; /* 右下 */
}
p{
  color: white;
  text-shadow:
      -1px -1px 0 #000, /* 左上 */
      1px -1px 0 #000, /* 右上 */
      -1px 1px 0 #000, /* 左下 */
      1px 1px 0 #000; /* 右下 */
}
  </style>