<template>
  <div class="titlebox">
    <el-image src="/images/weapons/part-weapon.png" style="width: 100px;height: 100px;" />
    <span class="title">决斗家武技</span>
  </div>
  <p>    决斗家的武器会拥有充能，可以消耗充能以释放武技。武器的充能上限为 <text class="gg">(英雄等级+8)/3</text> 且最高为10，每回合回复 <text class="gg">1/(60-1.5*(充能上限-当前充能数))</text> 的充能。</p>
<p>武斗者的副手与主手共享充能，充能上限+2且速度加快50%</p>
<p>决斗家可以用破损的短剑/短剑/单手剑/长剑/巨剑 <text class="gg">顺劈</text> 敌人。造成额外 3+等级/4+等级/4+等级/5+等级 伤害并且必定命中。如果顺劈击杀了一名敌人，决斗家可在5 回合内无消耗地再次使用顺劈。</p>

<p>决斗家可以用硬头锤/手斧/战斧/战锤使出 <text class="gg">重击</text> 。这用尽全力的一击造成 额外5+1.5*等级/4+1.5*等级/5+1.5*等级/6+1.5*等级 伤害并施加 5回合的恍惚，使其精准和闪避均减半。武技必中但若不是偷袭敌人则没有伤害加成。</p>
<p>决斗家握持匕首/长匕首/暗杀之刃时可以 <text class="gg">潜行</text> 。这个武技能够使决斗家立即闪现最多5/4/3格远，给予决斗家 2+等级 回合隐身，但消耗 2 点充能。</p>
<p>决斗家可以使用镶钉手套/双钗/魔岩拳套进行 <text class="gg">连击</text> 。这次攻击必定命中，并且决斗家在近期每使用近战或者投掷武器成功命中一次，这次攻击的伤害就增加 2+0.5*等级/3+0.67*等级/4+0.5*等级。连续命中判定持续五回合，五回合内再次命中即可增加连击数。</p>
<p>决斗家可用刺剑/武士刀对相距1格的敌人使出 <text class="gg">弓步刺</text> 。这一击会向敌人突进，造成额外 4+等级/6+1.5*等级的伤害，且必定命中。</p>
<p>决斗家可以用短柄镰/战镰来 <text class="gg">收割</text> 敌人，这一破坏性的攻击不直接造成伤害，但会施加等同于 12+2*等级/22.5+3.5*等级 伤害数值的流血，且必定命中，消耗2 点充能。</p>
<p>决斗家用长矛/关刀 <text class="gg">刺退</text> 在射程内但不与决斗家相邻的敌人。造成额外 7+1.5*等级/12+2*等级 伤害，将敌人击退并一定命中。</p>
<p>决斗家可以用圆盾/巨型方盾 <text class="gg">护卫</text> 自己，在5+等级/3+等级 回合内完全抵挡下一次针对自己的物理或魔法攻击，(与隐身同样)主动造成伤害或回合耗尽后移除。</p>
<p>决斗家可通过铁头棍进入 <text class="gg">防御架势</text> 。进入这一架势不消耗时间且将在 4+等级 回合内使她的闪避能力翻三倍，但会消耗2点充能。</p>
<p>决斗家可用弯刀进入 <text class="gg">剑舞</text> 。这个姿态使决斗家在 4+等级 回合内攻击速度 +60%且精准度 +50%，进入该姿态不消耗时间，消耗2点充能。</p>
<p>决斗家可以用长鞭 <text class="gg">狠抽</text> 她周围的所有敌人。这一武技对当前每个处于攻击距离内的敌人都进行一次普通攻击且必定命中，额外造成2+0.5*等级伤害。</p>
<p>决斗家可以 <text class="gg">甩动</text> 链枷以在短时间内积蓄力量。每被甩动一回合，链枷就会造成额外6+2*等级 的伤害，最多3次。甩动的链枷必定命中。开始甩动链枷消耗1点充能。</p>
<p>决斗家可以用符文之刃使出 <text class="gg">符文挥砍</text> 。这一击必定命中且有 2+0.5*等级 倍附魔力量。</p>
<p>决斗家可以使用十字驾准备好 <text class="gg">充能射击</text> 。这个武技会立即生效，使下一发飞镖必定命中其击中效果将会在7*7的范围内触发，增加 3+等级 的涂药飞镖使用次数。</p>
<p>决斗家在血量低于 50% 时可以使用巨斧进行 <text class="gg">报复</text> 攻击。这种毁灭性的攻击必定命中，且造成额外 12+2*等级伤害，若击杀则不消耗时间。</p>
<p>决斗家可用镐子来 <text class="gg">穿刺</text> 一个敌人。额外造成8+2*等级 伤害且必定命中，施加三回合的易伤，并且对有硬质表皮的敌人造成双倍伤害</p>
<p>硬质表皮包括有:dm100200300，电塔，魔像，骷髅，雕像，锈蚀之拳，水晶尖塔，水晶哨兵，灵性晶簇，蝇群，蜜蜂，螃蟹，蜘蛛，蝎子。</p>
<p>决斗家可通过武力戒指进入 <text class="gg">拳击架势</text> 。开启拳击架势时伤害为 武力戒指伤害+1+(力量8)/2+等级*(力量-2)/16。开启后充能减慢50%至少50回合，提前关闭也会持续</p>
  </template>
  
  <script>
  export default {
    name:'DuelistAbility',
    data() {
      return {
  
      }
    }
  }
  
  </script>
  
  <style scoped lang="less">
  .titlebox{
    display: flex;
    align-items: center;
    .title{
      font-size: 40px;
      color: rgb(255,255,68);
      text-shadow:
            -2px -2px 0 #000, /* 左上 */
            2px -2px 0 #000, /* 右上 */
          -2px 2px 0 #000, /* 左下 */
          2px 2px 0 #000; /* 右下 */
    }
  }
  :deep(.gg){
    color: rgb(255,255,68);
    text-shadow:
          -2px -2px 0 #000, /* 左上 */
          2px -2px 0 #000, /* 右上 */
        -2px 2px 0 #000, /* 左下 */
        2px 2px 0 #000; /* 右下 */
  }
  p{
    color: white;
    text-shadow:
          -1px -1px 0 #000, /* 左上 */
          1px -1px 0 #000, /* 右上 */
        -1px 1px 0 #000, /* 左下 */
        1px 1px 0 #000; /* 右下 */
  }
  </style>